app/controllers/api/v1/variants_controller.rb

INSERT INTO "variants" ("actual_price", "wood_type", "type_price", "variant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["actual_price", 800], ["wood_type", "Gold"], ["type_price", 100], ["variant_id", "19496400257"], ["created_at", "2016-05-24 10:04:37.314534"], ["updated_at", "2016-05-24 10:04:37.314534"]]
---
	def create
		@variant = Variant.new(variant_params)
		respond_to do |format|
	      if @variant.save