app/controllers/shipments_controller.rb

	def index
		@shipments = Shipment.all
---
SELECT "shipments".* FROM "shipments"

	def show
		@shipment = Shipment.find(params[:id])
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@shipment = Shipment.new(shipment_params)
		if @shipment.save
---
INSERT INTO "shipments" ("name", "country", "city", "state", "postal_code", "length", "width", "height", "weight", "cylinder", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

	def edit
		@shipment = Shipment.find(params[:id])
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@shipment = Shipment.find(params[:id])
		if @shipment.update_attributes(shipment_params)
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shipments" SET "length" = ?, "width" = ?, "height" = ?, "weight" = ?, "updated_at" = ? WHERE "shipments"."id" = ?  [["length", 40.0], ["width", 40.0], ["height", 20.0], ["weight", 1000.0], ["updated_at", "2016-05-03 11:13:23.258235"], ["id", 1]]